In [58]:
import numpy as np
import pandas as pd
import seaborn as sns

In [59]:
#persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.

In [60]:
df=pd.read_csv('persona.csv')
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [61]:
def check_df(dataframe, head=5):
    print("##################### Shape #####################")
    print(dataframe.shape)
    print("##################### Types #####################")
    print(dataframe.dtypes)
    print("##################### Head #####################")
    print(dataframe.head(head))
    print("##################### Tail #####################")
    print(dataframe.tail(head))
    print("##################### NA #####################")
    print(dataframe.isnull().sum())
    print("##################### Quantiles #####################")
    print(dataframe.describe([0, 0.05, 0.50, 0.95, 0.99, 1]).T)


check_df(df)

##################### Shape #####################
(5000, 5)
##################### Types #####################
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
##################### Head #####################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
##################### Tail #####################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
##################### NA #####################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
##################### Quantiles #####################
        count     mean        std   min    0%    5%   50%   95%   99%  100%  \
PRICE  5000.0  34.1320  12.464897   9.0   9.0  19.0  39.0  49.0  59.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  15.0  15.0  21.0  43.0  53.0  66.0

        max
PRICE  59.0
AGE    66.0

In [62]:
# Kaç unique SOURCE vardır? Frekansları nedir?

In [63]:
df['SOURCE'].nunique()

2

In [64]:
df['SOURCE'].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [65]:
#Kaç unique PRICE vardır?

In [66]:
df['PRICE'].nunique()

6

In [67]:
df["PRICE"].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [68]:
# Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [69]:
df['PRICE'].value_counts()

PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

In [70]:
pd.pivot_table(df,index='PRICE',aggfunc='size')

PRICE
9      200
19     992
29    1305
39    1260
49    1031
59     212
dtype: int64

In [71]:
df.groupby('PRICE').size()

PRICE
9      200
19     992
29    1305
39    1260
49    1031
59     212
dtype: int64

In [72]:
# Hangi ülkeden kaçar tane satış olmuş?

In [73]:
df['COUNTRY'].value_counts()

COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

In [74]:
df.pivot_table(values=['PRICE'],index=['COUNTRY'],aggfunc='count')

         PRICE
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

In [75]:
df.groupby('COUNTRY').size()

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
dtype: int64

In [76]:
# Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [77]:
df.groupby('COUNTRY')['PRICE'].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [78]:
df.groupby('COUNTRY')['PRICE'].agg({'sum'})

           sum
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [79]:
df.groupby('COUNTRY').agg({'PRICE':'sum'})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [80]:
df.pivot_table(values='PRICE',index='COUNTRY',aggfunc='sum')

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [81]:
# SOURCE türlerine göre satış sayıları nedir?

In [82]:
df.groupby('SOURCE').agg({'PRICE':'mean'})

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [83]:
df.groupby('SOURCE')['PRICE'].mean()

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

In [84]:
df.pivot_table(values='PRICE',index='SOURCE',aggfunc='mean')

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [85]:
# COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [86]:
df.groupby(['COUNTRY','SOURCE']).agg({'PRICE':'mean'})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

In [87]:
###### Görev 2: COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [88]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX','AGE']).agg({'PRICE': 'mean'}).head()

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897

In [89]:
##### Görev 3: Çıktıyı PRICE’a göre sıralayınız.

In [90]:
agg_df = df.groupby(['COUNTRY', 'SOURCE', 'SEX','AGE']).agg({'PRICE': 'mean'}).sort_values("PRICE", ascending = False)
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

In [91]:
##### Görev 4: Üçüncü sorunun çıktısında yer alan PRICE dışındaki tüm değişkenler index isimleridir. Bu isimleri değişken isimlerine çeviriniz.

In [92]:
agg_df['COUNTRY']=agg_df.index

In [93]:
agg_df.head()

                            PRICE                     COUNTRY
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0    (bra, android, male, 46)
usa     android male   36    59.0    (usa, android, male, 36)
fra     android female 24    59.0  (fra, android, female, 24)
usa     ios     male   32    54.0        (usa, ios, male, 32)
deu     android female 36    49.0  (deu, android, female, 36)

In [94]:
agg_df.drop('COUNTRY',axis=1,inplace=True)

In [95]:
agg_df=agg_df.reset_index()

In [96]:
# Görev 5: Age değişkenini kategorik değişkene çeviriniz ve agg_df’e ekleyiniz

In [97]:
age_bins = [0,18,23,30,40,70]
age_labels = ['0_18', '19_23', '24_30', '31_40', '41_70']

In [98]:
agg_df['AGE_CAT']=pd.cut(agg_df['AGE'],bins=age_bins,labels=age_labels)

In [99]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_70
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40

In [100]:
agg_df.nunique()

COUNTRY      6
SOURCE       2
SEX          2
AGE         46
PRICE      154
AGE_CAT      5
dtype: int64

In [101]:
#Görev 6 : Yeni seviye tabanlı müşterileri (persona) tanımlayınız.

In [102]:
agg_df["customers_level_based"] = (agg_df["COUNTRY"].astype(str)+"_" + agg_df["SOURCE"].astype(str)+"_" + agg_df["SEX"].astype(str) + "_" + agg_df["AGE"].astype(str) + "_" + agg_df["AGE_CAT"].astype(str)).str.upper()

In [103]:
agg_df.groupby(['customers_level_based'])['PRICE'].mean()

customers_level_based
BRA_ANDROID_FEMALE_15_0_18     38.714286
BRA_ANDROID_FEMALE_16_0_18     35.944444
BRA_ANDROID_FEMALE_17_0_18     35.666667
BRA_ANDROID_FEMALE_18_0_18     32.255814
BRA_ANDROID_FEMALE_19_19_23    35.206897
                                 ...
USA_IOS_MALE_42_41_70          30.250000
USA_IOS_MALE_50_41_70          39.000000
USA_IOS_MALE_53_41_70          34.000000
USA_IOS_MALE_55_41_70          29.000000
USA_IOS_MALE_59_41_70          46.500000
Name: PRICE, Length: 348, dtype: float64

In [104]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT        customers_level_based
0     bra  android    male   46   59.0   41_70    BRA_ANDROID_MALE_46_41_70
1     usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_36_31_40
2     fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_24_30
3     usa      ios    male   32   54.0   31_40        USA_IOS_MALE_32_31_40
4     deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_36_31_40

In [ ]:
#görev 7 Yeni müşterileri (Örnek: USA_ANDROID_MALE_0_18) PRICE’a göre 4 segmente ayırınız

In [105]:
agg_df['SEGMENT']=pd.qcut(agg_df['PRICE'],4,labels=["D", "C", "B", "A"])

In [106]:
agg_df.head()

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,customers_level_based,SEGMENT
0,bra,android,male,46,59.0,41_70,BRA_ANDROID_MALE_46_41_70,A
1,usa,android,male,36,59.0,31_40,USA_ANDROID_MALE_36_31_40,A
2,fra,android,female,24,59.0,24_30,FRA_ANDROID_FEMALE_24_24_30,A
3,usa,ios,male,32,54.0,31_40,USA_IOS_MALE_32_31_40,A
4,deu,android,female,36,49.0,31_40,DEU_ANDROID_FEMALE_36_31_40,A

In [107]:
segment_sum = agg_df.groupby("SEGMENT").agg(
    price_mean=("PRICE", "mean"),
    price_max=("PRICE", "max"),
    price_sum=("PRICE", "sum"))
agg_df.head()

C:\Users\xxxx\AppData\Local\Temp\ipykernel_23780\2640224692.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  segment_sum = agg_df.groupby("SEGMENT").agg(

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,customers_level_based,SEGMENT
0,bra,android,male,46,59.0,41_70,BRA_ANDROID_MALE_46_41_70,A
1,usa,android,male,36,59.0,31_40,USA_ANDROID_MALE_36_31_40,A
2,fra,android,female,24,59.0,24_30,FRA_ANDROID_FEMALE_24_24_30,A
3,usa,ios,male,32,54.0,31_40,USA_IOS_MALE_32_31_40,A
4,deu,android,female,36,49.0,31_40,DEU_ANDROID_FEMALE_36_31_40,A

In [108]:
# Görev 8:  Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini  tahmin ediniz

In [111]:
new_user = "TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["customers_level_based"] == new_user]
agg_df.groupby("SEGMENT").agg({"PRICE": ["mean","max","sum"]})

C:\Users\xxxx\AppData\Local\Temp\ipykernel_23780\238154130.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  agg_df.groupby("SEGMENT").agg({"PRICE": ["mean","max","sum"]})

             PRICE
              mean        max          sum
SEGMENT
D        27.302596  31.105263  2375.325850
C        32.933339  34.000000  3128.667165
B        35.436170  37.000000  2870.329792
A        41.434736  59.000000  3521.952577